# DataFrame 결합

In [ ]:
import pandas as pd

df1 = pd.DataFrame({"name" : ["Jessica", "Liam", "Sophia", "Alex"],
				   "age": [10,30,29,14]})

df2 = pd.DataFrame({"name" : ["Jessica", "Liam", "Sophia", "Alex"],	
					"department": ["AI", "Law", "AI", "Law"],		   
				   "score": [100,70,80,95],})

df3 = pd.DataFrame({"department": ["AI", "Law"],
					"head" : ["Steve", "Emma"]})

## 1. merge()

df + df 가로로 병합

### 1-1. 공통열이 하나일 경우

In [47]:
df = pd.merge(df1, df2)
display(df)

      name  age department  score
0  Jessica   10         AI    100
1     Liam   30        Law     70
2   Sophia   29         AI     80
3     Alex   14        Law     95

### 1-2. 공통 열이 여러 개일 경우

on 파라미터에 기준 열을 지정  
**공통 열이 하나여도 명시적으로 지정해주는 것이 바람직함**

In [48]:
df2["age"] = [10,20,30,40]
df = pd.merge(df1,df2, on="name")
display(df)

      name  age_x department  score  age_y
0  Jessica     10         AI    100     10
1     Liam     30        Law     70     20
2   Sophia     29         AI     80     30
3     Alex     14        Law     95     40

이런 것도 가능

In [49]:
display(pd.merge(df, df3, on="department"))

      name  age_x department  score  age_y   head
0  Jessica     10         AI    100     10  Steve
1     Liam     30        Law     70     20   Emma
2   Sophia     29         AI     80     30  Steve
3     Alex     14        Law     95     40   Emma

## 2. join()

merge()보다 간단함.  
인덱스 기준으로 병합.

In [56]:
df1 = pd.DataFrame({"age":[10,20,30,40]})
df2 = pd.DataFrame({"gender": ['F','M','M','F']})
df = df1.join(df2)

display(df)

   age gender
0   10      F
1   20      M
2   30      M
3   40      F

## 3. concat()

기존 DataFrame에 df를 추가  
**ignore_index** : index를 다시 매길 건지 (기본값 : False)

In [ ]:
df1 = pd.DataFrame({"name" : ["Jessica", "Liam", "Sophia", "Alex"],
				   "age": [10,30,29,14]})

df2 = pd.DataFrame({"name": ["James", "Eric"],
					"age": [20,30]})

display(pd.concat([df1,df2]))
display(pd.concat([df1, df2], ignore_index=True))

      name  age
0  Jessica   10
1     Liam   30
2   Sophia   29
3     Alex   14
0    James   20
1     Eric   30

      name  age
0  Jessica   10
1     Liam   30
2   Sophia   29
3     Alex   14
4    James   20
5     Eric   30